#!/bin/tcsh
#  __  __  ___  _   _  ____  ___  _     ____ ___ ____ _   _ ___ ____
# |  \/  |/ _ \| \ | |/ ___|/ _ \| |   | __ )_ _/ ___| | | |_ _/ ___|
# | |\/| | | | |  \| | |  _| | | | |   |  _ \| | |   | |_| || | |  _
# | |  | | |_| | |\  | |_| | |_| | |___| |_) | | |___|  _  || | |_| |
# |_|  |_|\___/|_| \_|\____|\___/|_____|____/___\____|_| |_|___\____|
#
# ХЭРЭГЛЭЭ:
# ./classstatistik.sh ../MongolianBaiti/classes
#
# count glyphs in the class
# =============================================
set cfolder=$1

foreach F (`find $cfolder -type f`)
    set count=`wc -l $F | cut -d" " -f1`
    echo $F" : "$count " glyphs"
end
